{
    "Raspberry Pi Robot Arm Surveillance Camera (November 2018)":"Programmed a Raspberry Pi that controlled a web camera mounted on a servo-motor robot arm. Implemented the ability to view a live feed, capture images, record video and control the servo arm over SSH",
    "Personal Website (May 2020)":"Registered a domain name and set up a personal website to showcase my projects and any future projects in the form of blog posts.",
    "Proxmox Virtualization Environment Host Node (February 2020)":"Installed the Proxmox VE operating system onto a desktop computer to act as a host node. Created LXC (Linux container) templates. Utilized containers to host web servers, Linux shells for friends, Discord chat bots, and Minecraft servers.",
    "RFID Card Attendance Scanner (December 2019)":"Developed a C program for a Texas Instruments TIVA LaunchPad Embedded Systems Board to interface with an RFID Card Reader to take attendance by scanning student ID cards. Implemented python script to send attendance list email.",
    "Arduino Digital Clock (December 2019)":"Programmed an Arduino to display the four digits of a digital clock onto a four-digit seven segment display. Implemented a circuit of two pushbuttons to be able to adjust the time by incrementing or decrementing the value due to the lack of a hardware clock and internet access to access an internet clock.",
    "Bogo Sort Bot (November 2019)":"Programmed a Raspberry Pi using Python and Linux tools to continuously attempt to sort a randomly generated list of numbers using the Bogo Sort sorting algorithm. Upon successfully sorting the list, subscribers in a mailing list were emailed the statistics and duration of the sorting process.",
    "Seinfeld Theme Door Sensor (November 2018)":"Constructed a circuit using an Arduino, ultrasonic sensor, and Adafruit MP3 Shield to play a randomly selected MP3 file when the ultrasonic sensor data deduced that an individual entered the room.",
    "Password Dump Parser (May 2018)":"Developed a Java program that generates statistics of publicly known password dumps to identify patterns in passwords. The statistics are used to educate the public about vulnerable passwords.",
    "Electromagnetic Generator (March 2012)":"Crafted a generator with RadioShack magnets and copper wire mounted to Plexiglas panels cut with a rotary saw, wire saw, deburring tool and sandpaper. Soldered diode to metal pins soldered to copper wire. Diode is powered when the magnets are spun inside copper wire coil.",
    "Bike Hub Electromagnetic Generator (June 2015)":"Implemented an electromagnetic generator in a bicycle hub for charging a mobile device while the bicycle is being ridden.",
    "Fan Baseball Cap (July 2017)":"Mounted, soldered and wired a computer fan to the bill of a baseball cap to blow air on the wearer’s face. The computer fan was soldered to an on/off switch and 4xAA battery power supply."
}